ixuan789/stm32_thermo/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define S2_Pin GPIO_PIN_4
#define S2_GPIO_Port GPIOA
#define S2_EXTI_IRQn EXTI4_IRQn
#define S3_Pin GPIO_PIN_5
#define S3_GPIO_Port GPIOA
#define S3_EXTI_IRQn EXTI9_5_IRQn
#define S4_Pin GPIO_PIN_6
#define S4_GPIO_Port GPIOA
#define S4_EXTI_IRQn EXTI9_5_IRQn
#define Blue_Pin GPIO_PIN_7
#define Blue_GPIO_Port GPIOA
#define Green_Pin GPIO_PIN_10
#define Green_GPIO_Port GPIOB
#define Red_Pin GPIO_PIN_11
#define Red_GPIO_Port GPIOB
#define CS_Pin GPIO_PIN_3
#define CS_GPIO_Port GPIOB
#define DC_Pin GPIO_PIN_4
#define DC_GPIO_Port GPIOB
#define RES_Pin GPIO_PIN_5
#define RES_GPIO_Port GPIOB
#define MOSI_Pin GPIO_PIN_6
#define MOSI_GPIO_Port GPIOB
#define SCLK_Pin GPIO_PIN_7
#define SCLK_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
